/*
*********************************************************************************************************
* 文件: ttypes.c
* 版本: V0.00
* 创建: Sat May 21 18:12:28 2016
* 作者: 谭化成
* 描述: 测试types.h中定义的基本数据类型
*********************************************************************************************************
*/

/* 包含头文件 -----------------------------------------------------------------------------------------*/
#include <stdio.h>
#include "ttypes.h"

/* 私有宏定义 -----------------------------------------------------------------------------------------*/

/* 私有数据类型声明 -----------------------------------------------------------------------------------*/

/* 私有全局变量定义 -----------------------------------------------------------------------------------*/

/* 私有函数声明 ---------------------------------------------------------------------------------------*/

/* 函数定义 -------------------------------------------------------------------------------------------*/
int main (int argc, char* argv[])
{
    printf("sizeof(uint8_t)\t\t= %ld\n", sizeof(uint8_t));
    printf("sizeof(int8_t)\t\t= %ld\n", sizeof(int8_t));

    printf("sizeof(uint16_t)\t= %ld\n", sizeof(uint16_t));
    printf("sizeof(int16_t)\t\t= %ld\n", sizeof(int16_t));

    printf("sizeof(uint32_t)\t= %ld\n", sizeof(uint32_t));
    printf("sizeof(int32_t)\t\t= %ld\n", sizeof(int32_t));

    printf("sizeof(uint64_t)\t= %ld\n", sizeof(uint64_t));
    printf("sizeof(int64_t)\t\t= %ld\n", sizeof(int64_t));

    printf("sizeof(fp32_t)\t\t= %ld\n", sizeof(fp32_t));
    printf("sizeof(fp64_t)\t\t= %ld\n", sizeof(fp64_t));

    printf("sizeof(BOOL)\t\t= %ld\n", sizeof(BOOL));
    printf("TRUE\t\t\t= %d\n", TRUE);
    printf("FALSE\t\t\t= %d\n", FALSE);

    return 0;
}

/********************************************* end of file *********************************************/

